const turingMachine = "Машина Тьюринга — это универсальный исполнитель (абстрактная вычислительная машина), предложенная в 1936 году А. Тьюрингом для уточнения понятия алгоритма. " +
    "Согласно тезису Тьюринга, любой алгоритм может быть записан в виде программы для машины Тьюринга. " +
    "Доказано, что машина Тьюринга по своим возможностям эквивалентна машине Поста и нормальным алгорифмам Маркова.";
const postMachine = "Машина Поста — это универсальный исполнитель (абстрактная вычислительная машина), основанный на работах Э.Л. Поста по уточнению понятия алгоритма. " +
    "Согласно тезису Поста, любой алгоритм может быть записан в виде программы для машины Поста. " +
    "Доказано, что машина Поста по своим возможностям эквивалентна машине Тьюринга и нормальным алгорифмам Маркова.";
export default {turingMachine, postMachine};